# 1. Ітератори в Python
# Ітератори — це об'єкти, які можуть послідовно перебирати елементи контейнера
# (наприклад, списку або словника). 
# Будь-який об'єкт, який підтримує методи __iter__() і __next__(), може бути ітератором.


# 1. Приклади ��тераторів в Python
my_list = [1, 2, 3]
iterator = iter(my_list)  # Отримуємо ітератор

print(next(iterator))  # 1
print(next(iterator))  # 2
print(next(iterator))  # 3

# Автоматична ітерація
# Елегантніший спосіб виконання автоматичної ітерації — використання циклу for. Наприклад:

# Визначаємо список
my_list = [4, 7, 0]
 
for element in my_list:
    print(element)

# Ітератори та цикл for
# Цикл for в Python використовується для ітерації по послідовності елементів, таких як список, 
# кортеж або рядок. Коли ми використовуємо цикл for з ітератором, 
# цикл автоматично перебиратиме елементи ітератора до тих пір, поки вони не закінчаться. Наприклад:

# Створюємо список цілих чисел
my_list = [1, 2, 3, 4, 5]
 
# Створюємо ітератор зі списку
iterator = iter(my_list)
 
# Перебираємо елементи ітератора
for element in iterator:
 
    # Виводимо кожен елемент на екран
    print(element)