# Практичне завдання: Створення інтерактивної програми управління списком справ
# Мета: Закріпити знання про порядок виконання коду, використання операторів умовного переходу 
# if else, циклів for і while, а також операторів break, continue та pass у Python.

# Завдання:

# Створення списку справ

# Напишіть програму, яка дозволяє користувачеві створювати список справ (to-do list).
# Програма повинна зберігати справи в списку.
# Додавання нових справ

# Користувач повинен мати можливість додавати нові справи до списку.
# Використовуйте цикл while, щоб програма продовжувала запитувати користувача про нові справи, поки він не вирішить завершити додавання.
# Відображення списку справ

# Напишіть функцію, яка виводить на екран усі справи зі списку.
# Використовуйте цикл for для перебору елементів списку.
# Видалення справ

# Користувач повинен мати можливість видаляти справи зі списку за їх індексом.
# Використовуйте оператори умовного переходу if else, щоб перевірити, чи індекс існує в списку перед видаленням.
# Позначення справ як виконані

# Додайте можливість позначати справи як виконані.
# Використовуйте цикл for або while, щоб дозволити користувачеві вибирати справи для позначення їх як виконаних.
# Використовуйте оператор break, щоб вийти з циклу після позначення справи.
# Пропуск справи

# Додайте можливість пропускати певні справи без виконання будь-якої дії.
# Використовуйте оператор continue для пропуску справи у циклі.
# Порожня дія

# Використовуйте оператор pass в місці, де поки що не потрібно виконувати жодної дії, але зберегти структуру програми.
# Завершення роботи програми

# Додайте можливість завершити роботу програми, коли користувач вирішить, що він завершив управління списком справ.


# Вітаємо у вашому списку справ!
# 1. Додати нову справу
# 2. Відобразити список справ
# 3. Видалити справу
# 4. Позначити справу як виконану
# 5. Пропустити справу
# 6. Вийти з програми
# Введіть ваш вибір: 

my_to_do_list = []

choies = 0

while choies != 6:

    print("# Вітаємо у вашому списку справ! \n 1. Додати нову справу \n 2. Відобразити список справ \n 3. Видалити справу") 
    print(" 4. Позначити справу як виконану \n 5. Пропустити справу \n 6. Вийти з програми \n ")
    choies = int(input("Введіть ваш вибір: "))

    if choies == 1:
        my_toDo = input("нову справу: ")
        my_to_do_list.append(my_toDo)

    elif choies == 2:
        if not my_to_do_list:
            print("Список порожній")
        else:
            for ToDo in my_to_do_list:
                print(ToDo)
        print("end to do list \n")

    elif choies == 3:
        index = int(input("delete to do list by index: "))
        if index > 0 and index < len(my_to_do_list):
            del my_to_do_list[index]
        else:
            print("index is no current !!! ")

    elif choies == 4:
        continue

    else:
        break